      *PROGRAMA DE TESTE
       IDENTIFICATION DIVISION. 
       PROGRAM-ID. TESTE.
       DATA DIVISION. 
       WORKING-STORAGE SECTION.
       01 WS-NOME       PIC X(10).
       PROCEDURE DIVISION.
           DISPLAY "DIGITE UM NOME: "
           ACCEPT WS-NOME
           DISPLAY "O NOME DIGITADO FOI: " WS-NOME
       STOP RUN.    